<template>
  <div>
    <v-tabs

      v-model="tab"
      background-color="deep-purple accent-4"
      class="elevation-2"
      dark
      :centered="centered"
      :grow="grow"
      :vertical="vertical"
      :right="right"
      :prev-icon="prevIcon ? 'mdi-arrow-left-bold-box-outline' : undefined"
      :next-icon="nextIcon ? 'mdi-arrow-right-bold-box-outline' : undefined"
      :icons-and-text="icons"
    >
      <v-tabs-slider></v-tabs-slider>

      <v-tab
        v-for="(item, index) in tabs"
        :key="index"
        :href="`#tab-${index}`"
      >
        {{item.title}}
        <v-icon v-if="icons">mdi-phone</v-icon>
      </v-tab>

      <v-tab-item
        v-for="(item,index) in tabs"
        :key="index"
        :value="'tab-' + index"
      >
        <v-card
          flat
          tile
        >
          <v-card-title>הדברת {{item.title}}</v-card-title>
          <v-card-text v-html="item.text"></v-card-text>
        </v-card>
      </v-tab-item>
    </v-tabs>
  </div>
</template>

<script>
export default {
    name: "animal-tabs",
    data() {
        return {
            tab: null,
            icons: false,
            centered: false,
            grow: false,
            vertical: true,
            prevIcon: false,
            nextIcon: false,
            right: false,
            tabs: [
                {
                    title: 'יתושים',
                    text: `
<p>3 סוגי יתושים נפוצים : אנופוליס, אדס וקולקס. היתושים מטילים את ביציהם בסביבת מים ולכן יש להימנע מחפצים אוגרי מים בסביבה הביתית.
</p>
<p>
היתושים יכולים להעביר מלריה קדחת הנילוס על בעת העקיצה. היתושים למעשה זקוקים למנת דם (הנקבות) 26.3.2008 פירסמה עיריית חיפה כי החלה בהדברה ניסיונית של יתושים באמצעות תכשיר ביולוגי, ידידותי לסביבה, הפועל על זחלי יתושים וזבובים אך אינו רעיל לבעלי חיים בעלי דם חם ולבני אדם. העירייה החליטה להשתמש בתכשיר ה"בק-תוש" כפיילוט למרות עלותו הגבוהה יחסית לחומרים אחרים במסגרת המדיניות הירוקה עליה הכריזה והמאמץ למנוע פגיעה במקורות מים ובבעלי חיים. פעולות העירייה בנושא מתואמות עם מנהל היחידה למלחמה במזיקים במשרד לאיכות הסביבה ד"ר עבד סיראטי, במטרה ליצור שיתוף פעולה שימנע ככל הניתן את התפרצות מחלת קדחת הנילוס המערבי בחיפה.
</p>
<p>
עיריית חיפה פנתה לתושבים לבדוק ולאתר מקווי מים עומדים כגון: חביות, פחים, צמיגים ישנים, ברזים דולפים, ולדווח למוקד העירוני 106 על כל מקור מים כדי לאפשר לאנשי ההדברה לטפל באופן מידי במניעת דגירה אפשרית של יתושים. בנוסף ממליצה העירייה להתהלך בשעות הלילה במקומות בהם יש יתושים בבגדים ארוכים ובהירים שכן צבע כהה מושך יתושים ולנקוט באמצעי הגנה נוספים כגון התקנת רשתות על חלונות ושימוש בתרסיסי הגנה המוכרים על ידי המשרד לאיכות הסביבה ומשרד הבריאות.
</p>
`
                },
                {
                    title: 'זבובים',
                    text: `
<p>זבובים מהווים מטרד בעיקר אך להם יכולת העברת מחלות מעיים שכן הם ניזונים מאורגניזם בעיקר צואה ולאחר מכן יכולים להגיע לצלחות, מזון וכדומה ובכך יכולים לגרום לזיהומים ומחלות בקרב בני האדם .
</p>
<p>זבוב החול הנו הזבוב המסוכן יותר.סוג זה של הזבוב לא עף אלא קופץ ממקום למקום בסמוך לחול ואדמה לכן הוא מאוד מסוכן לילדים מכיוון שהוא יכול לגרום לשושנת יריחו (לשמניה) על ידי העקיצה שלו\t</p>

`
                },
                {
                    title: 'תיקנים',
                    text: `
                    <p>ישנם 3 סוגי תיקנים נפוצים בחיפה </p>
                    <p><b>תיקן אמריקאי:</b> גדול בין המינים, חי כשנה ומטיל כ60 ביצים בכל הטלה.</p>
                    <p><b>תיקן גרמני:</b> אוהב אזורים חמים כגון מאחורי מקררים, תנורים מכונות כביסה מטיל כ 8 בכל הטלה אך מאוד קשה להדביר.</p>
                    <p><b>תיקן מזרחי:</b> צבעו שחור והוא מטיל כ- 10 ביצים בהטלה נפוץ בעיקר בעונות החמות בסביבות ביובים.</p>
                    `
                },
                {
                    title: 'חולדות',
                    text: `
<p>
בשל הקרבה לטבע ואזורים חקלאיים ניתן בחיפה למצוא גם את חולדת החוף שהיא גדולה יחסית אך בעיקר חולדה מצוייה ועכברים. מכרסמים אלה מגיעים לבתים למחסנים ולחצרות בכל דרך אפשרית אם בטיפוס על עצים, הליכה על חוטי חשמל וכרסום חורים בעץ ליצירת מחילות.
</p>
<p>
הדברת מפעלים בעת זיהוי חולדות ו/או עכברים בזמן יכולה למנוע נזקים של מאות אלפי שקלים שעלולים להיגרם עקב כרסום של מערכות החשמל, העכברים פעילים בעיקר בלילה, אולם בעונות מסוימות בעיקר לקראת החורף הם נראים גם ביום, העברים מטפסים על צינורות, עצים שיחים ומערכות הביוב.
</p>
                    <p>
                    לאחרונה נתקלנו בסיפור של עכבר בחיפה אשר נלכד תוך זמן קצר בבית הלקוח כאשר זיהינו את מקום המיסתור שלו בתוך קופסא. מבלי להפוך את הבית ולהרוג אותו הרחקנו את הקופסא מהמבנה והעכבר יצא לחופשי
כל הזכויות שמורות
</p>
`
                },
                {
                    title: 'יונים',
                    text: `
                    <p>יונים יכולות לגרום למספר רב של מפגעים בעיקר נזקים לרכוש, אך גם למחלות הנגרמות בשל טפילים אשר נמשכים אליהם ויכולים להיכנס לבתים.</p>
                    <p> בחיפה אזורים שלמים בעיקר בעיר התחתית בהם צואת יונים מהווה מטרד איום. אך גם בשכונות כגון נווה שאנן ובכרמל ניתן למצוא יונים מקננות במסתורי הכביסה.\t</p>
                    `
                },
                {
                    title: 'תולעים וזחלים',
                    text: `
                        <p>
תולעים וזחלים הם חלק מגלגולי המזיקים, בעיקר זבובים פרעושים ויתושים. הדברה מוקדמת של הזחלים מונעת את הגיעם לבגרות ולכן חומרים אלה נקראים מווסתי גידול מומלץ להשתמש בשירותי מדביר בחיפה לפני שהמזיקים מגיעים לבגרות</p>
<p>ישנן תולעים עם ראש שחור וגוף לבן אשר אלו תולעי אש ומטפסים על הקירות (יש כאלה אשר גוררים איתם את הקן) כנגד כאלה נדרש טיפול מיוחד של מדביר מוסמך בחיפה, כמו כן ניתן למצוא מזיקים בשם פסוקאים אשר ניזונים מעובש הקיים על הקירות בשל רטיבות, והפיתרון הוא טיפול ברטיבות לפני הדברה, עונת החורף היא עונה בה הפעילות שלהם מועטה אך עם תנאי גידול טובים הם יכולים להימצא כל השנה.</p>
                    `
                }
            ]
        }
    }
}
</script>

<style scoped>

</style>
